OpenFOAM/QGDFoam-OFv2012/cases/L-channel/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type             fixedValue;
        value            uniform 1.0; 
    }

    outlet
    {
        type             zeroGradient;
    }

    walls
    {
        type             zeroGradient;
    }

    sides
    {
        type    empty;
    }
}


// ************************************************************************* //
